Revit 2027 API
BoundingBoxContainsPointFilter(XYZ) Constructor
 Constructs a new instance of a filter to match elements with a bounding box that contains the given point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxContainsPointFilter(
	XYZ point
)
Public Sub New (
	point As XYZ
)
public:
BoundingBoxContainsPointFilter(
	XYZ^ point
)
new :
        point : XYZ -> BoundingBoxContainsPointFilter
Parameters
point XYZ
 The point used to find elements with a bounding box that contains it.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BoundingBoxContainsPointFilter Class
BoundingBoxContainsPointFilter Overload
Autodesk.Revit.DB Namespace